src/modules/hms/xml/claim_bypass.xml

<x:Envelope
        xmlns:x="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:apa="http://apace.systems/apacewebservices/"
        xmlns:zmf="http://zieto.co.za/claim/zmf"
>
    <x:Header>
        <apa:secureToken>eb4eeb1e9e03493e2d1db0e524c7da98f0bb2a11ad991335d0ee038560704906</apa:secureToken>
    </x:Header>
    <x:Body>
        <apa:processZMF>
            <apa:ZMF2_1Request>
                <zmf:Claim>
                    <zmf:Request>
                        <zmf:Transaction>
                            <zmf:VersionNumber>2.1</zmf:VersionNumber>
                            <zmf:Type>CL</zmf:Type>
                            <zmf:Number>1418</zmf:Number>
                            <zmf:DestinationCode>CMPUZWA</zmf:DestinationCode>
                            <zmf:SoftwareIdentifier>WCHMS</zmf:SoftwareIdentifier>
                            <zmf:OriginalSoftwareIdentifier>CAREMEDSOL</zmf:OriginalSoftwareIdentifier>
                            <zmf:DateTime>20220906105359</zmf:DateTime>
                            <zmf:TransactionLink>NA</zmf:TransactionLink>
                            <zmf:TestClaimIndicator>Y</zmf:TestClaimIndicator>
                            <zmf:CountryISOCode>ZW</zmf:CountryISOCode>
                        </zmf:Transaction>
                        <zmf:Provider>
                            <zmf:Role>SP</zmf:Role>
                            <zmf:PracticeNumber>02291</zmf:PracticeNumber>
                            <zmf:PracticeName>provider_number</zmf:PracticeName>
                        </zmf:Provider>
                        <zmf:Member>
                            <zmf:MedicalSchemeNumber>201000594</zmf:MedicalSchemeNumber>
                            <zmf:MedicalSchemeName>Cellmed Premium USD</zmf:MedicalSchemeName>
                        </zmf:Member>
                        <zmf:Patient>
                            <zmf:DependantCode>00</zmf:DependantCode>
                            <zmf:NewBornIndicator>N</zmf:NewBornIndicator>
                            <zmf:Personal>
                                <zmf:Title>MS</zmf:Title>
                                <zmf:Surname>NYAHUNDA</zmf:Surname>
                                <zmf:FirstName>MEGINA</zmf:FirstName>
                                <zmf:Initials>M</zmf:Initials>
                                <zmf:Gender>F</zmf:Gender>
                                <zmf:IDNumber>22143325F04</zmf:IDNumber>
                                <zmf:IDType>ID</zmf:IDType>
                                <zmf:DateOfBirth>19740201</zmf:DateOfBirth>
                            </zmf:Personal>
                        </zmf:Patient>
                        <zmf:ClaimHeader>
                            <zmf:ClaimNumber>1ru4mde158kwsxjv8b</zmf:ClaimNumber>
                            <zmf:ClaimDateTime>20220906105359</zmf:ClaimDateTime>
                            <zmf:TotalServices>1</zmf:TotalServices>
                            <zmf:TotalConsumables>0</zmf:TotalConsumables>
                            <zmf:WhomToPay>P</zmf:WhomToPay>
                            <zmf:InHospitalIndicator>N</zmf:InHospitalIndicator>
                            <zmf:MVAIndicator>N</zmf:MVAIndicator>
                            <zmf:IODIndicator>N</zmf:IODIndicator>
                            <zmf:AccidentIndicator>N</zmf:AccidentIndicator>
                            <zmf:EmergencyIndicator>N</zmf:EmergencyIndicator>
                            <zmf:DateOfAccident>20220906105359</zmf:DateOfAccident>
                            <zmf:WCANo>NA</zmf:WCANo>
                            <zmf:BatchNumber>NA</zmf:BatchNumber>
                            <zmf:BatchDateTime>20220906105359</zmf:BatchDateTime>
                            <zmf:Authorisation>
                                <zmf:PreAuthorisationNumber>BIOBYPASS</zmf:PreAuthorisationNumber>
                                <zmf:AuthorisationNumber>WRKFW</zmf:AuthorisationNumber>
                            </zmf:Authorisation>
                            <zmf:TotalValues>
                                <zmf:GrossAmount>789</zmf:GrossAmount>
                                <zmf:NettAmount>789</zmf:NettAmount>
                                <zmf:ReceiptAmount>0</zmf:ReceiptAmount>
                                <zmf:LevyAmount>0</zmf:LevyAmount>
                                <zmf:DiscountAmount>0</zmf:DiscountAmount>
                                <zmf:GenericSurchargeAmount>0</zmf:GenericSurchargeAmount>
                                <zmf:PatientPayAmount>0</zmf:PatientPayAmount>
                                <zmf:OverChargeAmount>0</zmf:OverChargeAmount>
                                <zmf:ContainerFeeAmount>0</zmf:ContainerFeeAmount>
                                <zmf:DispensingFeeAmount>0</zmf:DispensingFeeAmount>
                                <zmf:ProfessionalFeeAmount>0</zmf:ProfessionalFeeAmount>
                                <zmf:VarianceAmount>0</zmf:VarianceAmount>
                            </zmf:TotalValues>
                        </zmf:ClaimHeader>
                        <zmf:Service>
                            <zmf:Type>T</zmf:Type>
                            <zmf:Number>1</zmf:Number>
                            <zmf:CodeSet>NHRPL</zmf:CodeSet>
                            <zmf:Code>57248</zmf:Code>
                            <zmf:CodeDescription>Ward Fees</zmf:CodeDescription>
                            <zmf:ChargeableUnit>U</zmf:ChargeableUnit>
                            <zmf:ChargeableQuantity>1</zmf:ChargeableQuantity>
                            <zmf:SectionType>W</zmf:SectionType>
                            <zmf:ServiceStartDateTime>20220906105359</zmf:ServiceStartDateTime>
                            <zmf:ServiceEndDateTime>20220906105359</zmf:ServiceEndDateTime>
                            <zmf:ExternalReferenceNumber>A1223422</zmf:ExternalReferenceNumber>
                            <zmf:BenefitCode>A223</zmf:BenefitCode>
                            <zmf:BenefitDescription>Descr</zmf:BenefitDescription>
                            <zmf:NumberOfConsumables>0</zmf:NumberOfConsumables>
                            <zmf:Identifier>0</zmf:Identifier>
                            <zmf:NumberOfLaboratoryRecords>0</zmf:NumberOfLaboratoryRecords>
                            <zmf:NumberOfToothRecords>0</zmf:NumberOfToothRecords>
                            <zmf:NumberOfDentalLaboratoryRecords>0</zmf:NumberOfDentalLaboratoryRecords>
                            <zmf:NumberOfOptometryRecords>0</zmf:NumberOfOptometryRecords>
                            <zmf:WhomToPay>P</zmf:WhomToPay>
                            <zmf:UpdateIndicator>N</zmf:UpdateIndicator>
                            <zmf:Authorisation>
                                <zmf:PreAuthorisationNumber>BIOBYPASS</zmf:PreAuthorisationNumber>
                                <zmf:AuthorisationNumber>WRKFW</zmf:AuthorisationNumber>
                                <zmf:AuthorisationDate>20211208</zmf:AuthorisationDate>
                            </zmf:Authorisation>
                            <zmf:Procedure>
                                <zmf:Stage>P</zmf:Stage>
                                <zmf:CodeSet>CPT</zmf:CodeSet>
                                <zmf:Code>43235</zmf:Code>
                                <zmf:Description>Gastroscopy</zmf:Description>
                            </zmf:Procedure>
                            <zmf:Provider>
                                <zmf:Role>SP</zmf:Role>
                                <zmf:PracticeNumber>02291</zmf:PracticeNumber>
                                <zmf:PracticeName>provider_number</zmf:PracticeName>
                            </zmf:Provider>
                            <zmf:Diagnosis>
                                <zmf:Stage>P</zmf:Stage>
                                <zmf:CodeSet>ICD</zmf:CodeSet>
                                <zmf:Code>E98.1</zmf:Code>
                            </zmf:Diagnosis>
                            <zmf:SubTotalValues>
                                <zmf:GrossAmount>789</zmf:GrossAmount>
                                <zmf:NettAmount>789</zmf:NettAmount>
                                <zmf:ReceiptAmount>0</zmf:ReceiptAmount>
                                <zmf:LevyAmount>0</zmf:LevyAmount>
                                <zmf:DiscountAmount>0</zmf:DiscountAmount>
                                <zmf:GenericSurchargeAmount>0</zmf:GenericSurchargeAmount>
                                <zmf:PatientPayAmount>0</zmf:PatientPayAmount>
                                <zmf:OverChargeAmount>0</zmf:OverChargeAmount>
                                <zmf:ContainerFeeAmount>0</zmf:ContainerFeeAmount>
                                <zmf:DispensingFeeAmount>0</zmf:DispensingFeeAmount>
                                <zmf:ProfessionalFeeAmount>0</zmf:ProfessionalFeeAmount>
                                <zmf:VarianceAmount>0</zmf:VarianceAmount>
                            </zmf:SubTotalValues>
                            <zmf:Message>
                                <zmf:Type>I</zmf:Type>
                                <zmf:Code>10008</zmf:Code>
                                <zmf:Description>Service request message</zmf:Description>
                            </zmf:Message>
                            <zmf:TotalValues>
                                <zmf:GrossAmount>789</zmf:GrossAmount>
                                <zmf:NettAmount>789</zmf:NettAmount>
                                <zmf:ReceiptAmount>0</zmf:ReceiptAmount>
                                <zmf:LevyAmount>0</zmf:LevyAmount>
                                <zmf:DiscountAmount>0</zmf:DiscountAmount>
                                <zmf:GenericSurchargeAmount>0</zmf:GenericSurchargeAmount>
                                <zmf:PatientPayAmount>0</zmf:PatientPayAmount>
                                <zmf:OverChargeAmount>0</zmf:OverChargeAmount>
                                <zmf:ContainerFeeAmount>0</zmf:ContainerFeeAmount>
                                <zmf:DispensingFeeAmount>0</zmf:DispensingFeeAmount>
                                <zmf:ProfessionalFeeAmount>0</zmf:ProfessionalFeeAmount>
                                <zmf:VarianceAmount>0</zmf:VarianceAmount>
                            </zmf:TotalValues>
                        </zmf:Service>
                    </zmf:Request>
                </zmf:Claim>
            </apa:ZMF2_1Request>
        </apa:processZMF>
    </x:Body>
</x:Envelope>